## NAME : HARII SARAVANAN A
## DEPARTMENT : ARTIFICIAL INTELLIGENCE AND DATA SCIENCE
## YEAR/SEMESTER/SECTION : II / III /  A

# Multiple Linear Regression Using Placement Salary Prediction Dataset

## Importing Libraries

In [62]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Importing Datasets

In [63]:
data = pd.read_csv('placement_salary.csv')
data

   Experience  Test_Score  Interview_score  Salary
0         NaN         8.0                9   50000
1         NaN         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         NaN                7   72000
7        11.0         7.0                8   80000

In [64]:
#filling missing values column using fillna method

In [65]:
import math 
me = math.floor(data.Test_Score.median())
data.Test_Score = data.Test_Score.fillna(me)
me = math.floor(data.Experience.median())
data.Experience = data.Experience.fillna(me)
data

   Experience  Test_Score  Interview_score  Salary
0         6.0         8.0                9   50000
1         6.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         8.0                7   72000
7        11.0         7.0                8   80000

In [66]:
#extract the x independent variable and y dependent variable

In [68]:
X = data.iloc[:,0:3].values
Y = data.iloc[:,3].values

In [69]:
#using multiple linear regression

In [70]:
from sklearn.linear_model import LinearRegression
reg = LinearRegression()
reg.fit(X,Y)

LinearRegression()

In [71]:
#extracting the coefficent or slope and intercept

In [72]:
b = reg.coef_
b0 = reg.intercept_
b1 = b[0]
b2 = b[1]
b3 = b[2]
print("B0:",b0,"\nB1:",b1,"\nB2:",b2,"\nB3:",b3)

B0: 11869.91869918695
B1: 2813.0081300813017
B2: 1333.3333333333358
B3: 2926.829268292685

In [73]:
print("Where salry is 12 year,10 test score,10 interview score:",reg.predict([[12,10,10]]))

Where salry is 12 year,10 test score,10 interview score: [88227.64227642]

In [74]:
print("Where salry is 2 year,9 test score,6 interview score:",reg.predict([[2,9,6]]))

Where salry is 2 year,9 test score,6 interview score: [47056.91056911]

## Thank You